Table of Contents
Namespace IdeaRS.OpenModel.Concrete.CheckResult
 Classes
ConcreteCheckDetailing
Check Detailing base
ConcreteCheckDetailingEc2
Check Detailing Ec2
ConcreteCheckResult
Concrete Check results
ConcreteCheckResultBase
Concrete result base class
ConcreteCheckResultOverall
Concrete check result
ConcreteCheckResultOverallItem
Overal check item
ConcreteCheckResults
Concrete Check results
ConcreteSLSCheckResultCrackWidth
SLS Check Crack width base
ConcreteSLSCheckResultCrackWidthEc2
SLS Check Crack width Ec2
ConcreteSLSCheckResultStiffness
SLS Check tiffness base
ConcreteSLSCheckResultStiffnessEc2
SLS Check Stiffness Ec2
ConcreteSLSCheckResultStressLimitation
SLS Check Stress Limitation base
ConcreteSLSCheckResultStressLimitationEc2
SLS Check Stress Limitation Ec2
ConcreteULSCheckResultDiagramCapacity
ULS Check Diagram Capacity base
ConcreteULSCheckResultDiagramCapacityEc2
ULS Check Diagram Capacity Ec2
ConcreteULSCheckResultFatigue
ULS Check Fatigue base
ConcreteULSCheckResultFatigueEc2
ULS Check Fatigue Ec2
ConcreteULSCheckResultInteraction
ULS Check Interaction base
ConcreteULSCheckResultInteractionEc2
ULS Check Interaction Ec2
ConcreteULSCheckResultResponse
ULS CheckResponce base
ConcreteULSCheckResultResponseEc2
ULS CheckResponce Ec2
ConcreteULSCheckResultShear
ULS Check Shear base
ConcreteULSCheckResultShearEc2
ULS Check Shear Ec2
ConcreteULSCheckResultTorsion
ULS Check Torsion base
ConcreteULSCheckResultTorsionEc2
ULS Check Torsion Ec2
SectionConcreteCheckResult
ection concrete result
SectionStiffnesses
Section stiffnesses
 Enums
CalculationType
Calculation type
CheckResult
The number in enum value description means the priority for extreme check evaluation.
CheckResultType
Check result type
FatigueMethod
Verification of concrete under compression or shear
IntDiagCheckMethod
Flags controlling the method of the check by a interaction diagram
ShearMethod
Method of shear calculation
TypeSLSLimitStressCheck
Type of SLS check in extreme result